Using TensorFlow backend.
('X_train shape:', (3640, 2051, 18, 1))
('X_dev shape:', (243, 2051, 18, 1))
('X_test shape:', (243, 2051, 18, 1))
('X_train Mean value:', -0.02758026191672634) % frequency data was not normalized
('X_train STD value:', 1.1536596790971865) % frequency data was not normalized

__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 2051, 18, 1)  0                                            
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 2051, 6, 1)   0           input_1[0][0]                    
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 2051, 12, 1)  0           input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 2051, 6, 60)  900         lambda_1[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 2051, 12, 60) 900         lambda_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 2051, 6, 60)  240         conv2d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 2051, 12, 60) 240         conv2d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 1025, 6, 60)  0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 1025, 12, 60) 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 1025, 6, 60)  0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 1025, 12, 60) 0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 1025, 6, 60)  50460       dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 1025, 12, 60) 50460       dropout_5[0][0]                  
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 1025, 6, 60)  240         conv2d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 1025, 12, 60) 240         conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 512, 6, 60)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 512, 12, 60)  0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 512, 6, 60)   0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 512, 12, 60)  0           max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 512, 2, 60)   453660      dropout_2[0][0]                  
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 512, 4, 60)   453660      dropout_6[0][0]                  
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 512, 2, 60)   240         conv2d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 512, 4, 60)   240         conv2d_6[0][0]                   
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 512, 2, 60)   0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 512, 4, 60)   0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 60)           0           dropout_3[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 60)           0           dropout_7[0][0]                  
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 60)           0           global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 60)           0           global_average_pooling2d_2[0][0] 
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 13)           793         dropout_4[0][0]                  
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 13)           793         dropout_8[0][0]                  
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 26)           0           dense_1[0][0]                    
                                                                 dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 71)           1917        concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 13)           936         dense_3[0][0]                    
==================================================================================================
Total params: 1,015,919
Trainable params: 1,015,199
Non-trainable params: 720
__________________________________________________________________________________________________
Train on 3640 samples, validate on 243 samples

